[{
    "name": "Premchand (Translated by M. Asaduddin)",
    "bio": null
}, {
    "name": "Jeffrey Archer",
    "bio": "Jeffrey Howard Archer (born 15 April 1940) is an English novelist, former politician, convicted perjurer, and peer of the realm.\nBefore becoming an author, Archer was a Member of Parliament (1969–1974), but did not seek re-election after a financial scandal that left him almost bankrupt. He revived his fortunes as a best-selling novelist; his books have sold around 330 million copies worldwide.Archer became deputy chairman of the Conservative Party (1985–86), before resigning after a newspaper accused him of paying money to a prostitute."
}, {
    "name": "Sophie Kinsella",
    "bio": "Madeleine Sophie Townley (born 12 December 1969), known by her pen name Sophie Kinsella, is an English author. The first two novels in her best-selling Shopaholic series, The Secret Dreamworld of a Shopaholic and Shopaholic Abroad, were adapted into the film Confessions of a Shopaholic (2009). Her books have sold over 40 million copies in more than 60 countries, and been translated into over 40 languages."
}, {
    "name": "Haruki Murakami",
    "bio": "Haruki Murakami (村上 春樹, Murakami Haruki, born January 12, 1949) is a Japanese writer. His books and stories have been bestsellers in Japan as well as internationally, with his work being translated into 50 languages and selling millions of copies outside his native country. His work has received numerous awards, including the World Fantasy Award, the Frank O'Connor International Short Story Award, the Franz Kafka Prize, and the Jerusalem Prize."
}, {
    "name": "Premchand (M. Asaduddin Ed.)",
    "bio": null
}, {
    "name": "Premchand (Translated by M. Asaduddin)",
    "bio": null
}, {
    "name": "Premchand (Translated by M. Asaduddin)",
    "bio": null
}, {
    "name": "Salman Rushdie",
    "bio": "Sir Ahmed Salman Rushdie  (born 19 June 1947) is a British Indian novelist and essayist. His second novel, Midnight's Children (1981), won the Booker Prize in 1981 and was deemed to be \"the best novel of all winners\" on two separate occasions, marking the 25th and the 40th anniversary of the prize. Much of his fiction is set on the Indian subcontinent."
}, {
    "name": "Nelson Mandela",
    "bio": "Nelson Rolihlahla Mandela (; Xhosa: [xolíɬaɬa mandɛ̂ːla]; 18 July 1918 – 5 December 2013) was a South African anti-apartheid revolutionary, political leader, and philanthropist who served as President of South Africa from 1994 to 1999. He was the country's first black head of state and the first elected in a fully representative democratic election. His government focused on dismantling the legacy of apartheid by tackling institutionalised racism and fostering racial reconciliation."
}, {
    "name": "John le Carré",
    "bio": "David John Moore Cornwell (born 19 October 1931), better known by the pen name John le Carré (), is a British author of espionage novels. During the 1950s and 1960s, he worked for both the Security Service (MI5) and the Secret Intelligence Service (MI6). His third novel, The Spy Who Came in from the Cold (1963), became an international best-seller and remains one of his best-known works."
}, {
    "name": "Alexander McCall Smith",
    "bio": "R. Alexander \"Sandy\" McCall Smith, CBE, FRSE (born 24 August 1948), is a British-Zimbabwean  writer and Emeritus Professor of Medical Law at the University of Edinburgh. In the late 20th century, McCall Smith became a respected expert on medical law and bioethics and served on British and international committees concerned with these issues.\nHe has since become internationally known as a writer of fiction, with sales of English-language versions exceeding 40 million by 2010 and translations into 46 languages."
}, {
    "name": "George R.R. Martin",
    "bio": "George Raymond Richard Martin (born George Raymond Martin; September 20, 1948), also known as GRRM, is an American novelist and short story writer in the fantasy, horror, and science fiction genres, screenwriter, and television producer. He is writing the series of epic fantasy novels A Song of Ice and Fire, which was adapted into the HBO series Game of Thrones (2011–2019).\nIn 2005, Lev Grossman of Time called Martin \"the American Tolkien\", and in 2011, he was included on the annual Time 100 list of the most influential people in the world."
}, {
    "name": "William Shakespeare",
    "bio": "William Shakespeare (bapt. 26 April 1564 – 23 April 1616) was an English poet, playwright, and actor, widely regarded as the greatest writer in the English language and the world's greatest dramatist. He is often called England's national poet and the \"Bard of Avon\" (or simply \"the Bard\")."
}, {
    "name": "Aniket S. Sharma",
    "bio": "Ishq Mein Marjawan (I Will Die In This Love) is an Indian television series. It aired from 20 September 2017 to 28 June 2019 on Colors TV. Produced by Yash A Patnaik under Beyond Dreams Entertainment, it starred Arjun Bijlani, Aalisha Panwar, Nia Sharma and Sonarika Bhadoria as Deep Raj Singh, Tara Raichand, Aarohi Kashyap and Netra Sharma.\n\n\n== Plot ==\nA mysterious female serial killer murders a woman who was cheating on her partner."
}, {
    "name": "Raymond Chandler",
    "bio": "Raymond Thornton Chandler (July 23, 1888 – March 26, 1959) was an American-British novelist and screenwriter. In 1932, at the age of forty-four, Chandler became a detective fiction writer after losing his job as an oil company executive during the Great Depression. His first short story, \"Blackmailers Don't Shoot\", was published in 1933 in Black Mask, a popular pulp magazine."
}, {
    "name": "Jane Austen",
    "bio": null
}, {
    "name": "Homer",
    "bio": "Homer (; Ancient Greek: Ὅμηρος Greek pronunciation: [hómɛːros], Hómēros) is the legendary author of the Iliad and the Odyssey, two epic poems that are the central works of ancient Greek literature. The Iliad is set during the Trojan War, the ten-year siege of the city of Troy by a coalition of Greek kingdoms. It focuses on a quarrel between King Agamemnon and the warrior Achilles lasting a few weeks during the last year of the war."
}, {
    "name": "James Joyce",
    "bio": "James Augustine Aloysius Joyce (2 February 1882 – 13 January 1941) was an Irish novelist, short story writer, poet, teacher, and literary critic. He contributed to the modernist avant-garde and is regarded as one of the most influential and important authors of the 20th century. Joyce is best known for Ulysses (1922), a landmark work in which the episodes of Homer's Odyssey are paralleled in a variety of literary styles, most famously stream of consciousness."
}, {
    "name": "Noel Botham",
    "bio": "Noel Botham (23 January 1940 - 23 November 2012) was a British tabloid journalist and prolific author.\nHe wrote books on the love-life of Princess Margaret and the death of Diana, Princess of Wales (The Murder of Princess Diana), as well a series of books of obscure facts with the theme of \"Useless Information\", some of which was wildly erroneous; for example, \"It would take 150 million years to drive a car to the sun\" in The Totally Awesome Book of Useless Information. Also noted as a raconteur and publican, for many years he ran one of Soho's landmark pubs, The French House."
}, {
    "name": "Richard Bachman",
    "bio": "Richard Bachman is a pen name used by horror fiction author Stephen King.\n\n\n== Origin ==\nAt the beginning of Stephen King's career, the general view among publishers was that an author was limited to one book per year, since publishing more would be unacceptable to the public. King therefore wanted to write under another name, in order to increase his publication without over-saturating the market for the King \"brand\"."
}, {
    "name": "Cathy Kelly",
    "bio": "Cathy Kelly (born 12 September 1966) is an Irish former journalist and writer of women's fiction since 1997. She has gained international recognition with her popular fiction novels, which are published globally in many languages. In 2001, her novel Someone Like You won the Romantic Novel of the Year Award by the Romantic Novelists' Association."
}, {
    "name": "Robin Cook",
    "bio": "Robert Finlayson Cook (28 February 1946 – 6 August 2005) was a British Labour Party politician, who served as the Member of Parliament (MP) for Livingston from 1983 until his death and served in the Cabinet as Foreign Secretary from 1997 until 2001, when he was replaced by Jack Straw.\nHe studied at the University of Edinburgh before being elected as the Member of Parliament for Edinburgh Central in 1974. In Parliament he was known for his debating ability and rapidly rose through the political ranks and ultimately into the Cabinet."
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "Toni Morrison",
    "bio": "Chloe Anthony Wofford Morrison (born Chloe Ardelia Wofford; February 18, 1931 – August 5, 2019), known as Toni Morrison, was an American novelist, essayist, book editor, and college professor. Her first novel, The Bluest Eye, was published in 1970. The critically acclaimed Song of Solomon (1977) brought her national attention and won the National Book Critics Circle Award."
}, {
    "name": "Franz Kafka",
    "bio": "Franz Kafka (3 July 1883 – 3 June 1924) was a German-speaking Bohemian novelist and short-story writer, widely regarded as one of the major figures of 20th-century literature. His work fuses elements of realism and the fantastic.  It typically features isolated protagonists facing bizarre or surrealistic predicaments and incomprehensible socio-bureaucratic powers."
}, {
    "name": "Aldous Huxley",
    "bio": "Aldous Leonard Huxley (26 July 1894 – 22 November 1963) was an English writer and philosopher. He wrote nearly fifty books—both novels and non-fiction works—as well as wide-ranging essays, narratives, and poems.\nBorn into the prominent Huxley family, he graduated from Balliol College, Oxford with an undergraduate degree in English literature."
}, {
    "name": "Yuval Noah Harari",
    "bio": "Yuval Noah Harari (Hebrew: יובל נח הררי‎, [juˈval ˈnoaχ (h)aˈʁaʁi]; born 24 February 1976) is an Israeli historian and a professor in the Department of History at the Hebrew University of Jerusalem. He is the author of the popular science bestsellers Sapiens: A Brief History of Humankind (2014), Homo Deus: A Brief History of Tomorrow (2016), and 21 Lessons for the 21st Century (2018). His writings examine free will, consciousness, intelligence and happiness."
}, {
    "name": "Jeffrey Archer",
    "bio": "Jeffrey Howard Archer (born 15 April 1940) is an English novelist, former politician, convicted perjurer, and peer of the realm.\nBefore becoming an author, Archer was a Member of Parliament (1969–1974), but did not seek re-election after a financial scandal that left him almost bankrupt. He revived his fortunes as a best-selling novelist; his books have sold around 330 million copies worldwide.Archer became deputy chairman of the Conservative Party (1985–86), before resigning after a newspaper accused him of paying money to a prostitute."
}, {
    "name": "John Grisham",
    "bio": null
}, {
    "name": "Christopher C. Doyle",
    "bio": "The Mahabharata Secret is the debut novel by Indian author Christopher C. Doyle and was released on 21 October 2013 by Om Books. The story follows Vijay and his friends, as they try to decipher a series of clues which would lead them to a devastating Secret hidden by a brotherhood known as the Nine Men. Doyle had initially started writing a story for his daughter, which gradually expanded into the book."
}, {
    "name": "Frederick Forsyth",
    "bio": "Frederick McCarthy Forsyth,  (born 25 August 1938) is an English author, journalist, former spy, and occasional political commentator. He is best known for thrillers such as The Day of the Jackal, The Odessa File, The Fourth Protocol, The Dogs of War, The Devil's Alternative, The Fist of God, Icon, The Veteran, Avenger, The Afghan, The Cobra and The Kill List.\nForsyth's works frequently appear on best-sellers lists and more than a dozen of his titles have been adapted to film."
}, {
    "name": "Frederick Forsyth",
    "bio": "Frederick McCarthy Forsyth,  (born 25 August 1938) is an English author, journalist, former spy, and occasional political commentator. He is best known for thrillers such as The Day of the Jackal, The Odessa File, The Fourth Protocol, The Dogs of War, The Devil's Alternative, The Fist of God, Icon, The Veteran, Avenger, The Afghan, The Cobra and The Kill List.\nForsyth's works frequently appear on best-sellers lists and more than a dozen of his titles have been adapted to film."
}, {
    "name": "Sidney Sheldon",
    "bio": "Sidney Sheldon (February 11, 1917 – January 30, 2007) was an American writer and producer.\nSheldon was prominent in the 1930s, first working on Broadway plays and then in motion pictures, notably writing the successful comedy The Bachelor and the Bobby-Soxer (1947) which earned him an Oscar in 1948. He went on to work in television, where his works spanned a 20-year period during which he created The Patty Duke Show (1963–66), I Dream of Jeannie (1965–70) and Hart to Hart (1979–84)."
}, {
    "name": "Agatha Christie",
    "bio": "Dame Agatha Mary Clarissa Christie, Lady Mallowan,  (née Miller; 15 September 1890 – 12 January 1976) was an English writer known for her sixty-six detective novels and fourteen short story collections, particularly those revolving around fictional detectives Hercule Poirot and Miss Marple. She also wrote the world's longest-running play The Mousetrap, performed in the West End since 1952, as well as six romances under the pseudonym Mary Westmacott. In 1971, she was appointed a Dame Commander of the Order of the British Empire (DBE) for her contribution to literature.Christie was born into a wealthy upper-middle-class family in Torquay, Devon."
}, {
    "name": "Agatha Christie",
    "bio": "Dame Agatha Mary Clarissa Christie, Lady Mallowan,  (née Miller; 15 September 1890 – 12 January 1976) was an English writer known for her sixty-six detective novels and fourteen short story collections, particularly those revolving around fictional detectives Hercule Poirot and Miss Marple. She also wrote the world's longest-running play The Mousetrap, performed in the West End since 1952, as well as six romances under the pseudonym Mary Westmacott. In 1971, she was appointed a Dame Commander of the Order of the British Empire (DBE) for her contribution to literature.Christie was born into a wealthy upper-middle-class family in Torquay, Devon."
}, {
    "name": "Frederick Forsyth",
    "bio": "Frederick McCarthy Forsyth,  (born 25 August 1938) is an English author, journalist, former spy, and occasional political commentator. He is best known for thrillers such as The Day of the Jackal, The Odessa File, The Fourth Protocol, The Dogs of War, The Devil's Alternative, The Fist of God, Icon, The Veteran, Avenger, The Afghan, The Cobra and The Kill List.\nForsyth's works frequently appear on best-sellers lists and more than a dozen of his titles have been adapted to film."
}, {
    "name": "Markus Zusak",
    "bio": "Markus Zusak (born 23 June 1975) is an Australian writer of German origin. He is best known for The Book Thief and The Messenger (US title: I Am the Messenger), two novels which became international bestsellers. He won the Margaret A. Edwards Award in 2014."
}]
