[{"title": "The Complete Short Stories: Vol. 1", "author": "Premchand (Translated by M. Asaduddin)", "genre": "Comics & Graphic Novels", "isbn": "9780143441281", "numPages": null, "description": null}, {"title": "Nothing Ventured", "author": "Jeffrey Archer", "genre": "Children's Books", "isbn": "9781529014914", "numPages": null, "description": "**#1 _NYT_ bestseller Archer launches a brilliant series – a Clifton\nChronicles spinoff – about Detective Warwick. _But this is not a detective\nstory, this is a story about the making of a detective._**  \n  \nJeffrey Archer's Clifton Chronicles reinvigorated his already-illustrious\ncareer to the highest sales level in a decade, and now Archer launches a\nbrand-new family saga tailor-made for Clifton fans: the life story of William\nWarwick. William is a new recruit in the London Metropolitan Police Force, and\nhis father is a distinguished judge. Rather than follow in his father's\nfootsteps, the way his sister has, William has always wanted to be a\ndetective.  \n  \nThis series debut traces William's complicated relationships with his family;\nthe origins of his career; his first mentor, career police officer Fred Yates;\nhis first months on the beat; and his first case as a detective, an\ninvestigation into an art theft ring which has continually outsmarted Scotland\nYard. It also introduces the series villains, ruthless art collector Miles\nFaulkner and his defense attorney, Booth Watson.  \n  \nAs with the Clifton Chronicles, the Warwick novels tell the story of a man, a\nfamily, and an era of our times in the way only Jeffrey Archer can. His\nlegions of fans will be enthralled through each volume, as we follow William's\nlife, through his career, his love life, his family, and the many triumphs and\ntragedies of each.\n\n"}, {"title": "Christmas Shopaholic", "author": "Sophie Kinsella", "genre": "Romance", "isbn": "9781787631977", "numPages": "384", "description": "**Celebrate Christmas with the ultimate Shopaholic!**  \n  \n **The brilliant laugh-out-loud festive novel from the Number One bestselling\nauthor.**  \n  \nBecky Brandon (née Bloomwood) adores Christmas. It's always the same – Mum and\nDad hosting, carols playing, Mum pretending she made the Christmas pudding,\nand the next-door neighbours coming round for sherry in their terrible festive\njumpers.  \n  \nAnd now it's even easier with online bargain-shopping sites – if you spend\nenough you even get free delivery. Sorted!  \n  \nBut this year looks set to be different. Unable to resist the draw of craft\nbeer and smashed avocado, Becky's parents are moving to ultra-trendy\nShoreditch and have asked Becky if she'll host Christmas this year. What could\npossibly go wrong?  \n  \nWith sister Jess demanding a vegan turkey, husband Luke determined that he\njust wants aftershave _again_ , and little Minnie insisting on a very specific\npicnic hamper – surely Becky can manage all this, as well as the surprise\nappearance of an old boyfriend and his pushy new girlfriend, whose motives are\nfar from clear . . .  \n  \nWill chaos ensue, or will Becky manage to bring comfort and joy to Christmas?  \n  \n **AVAILABLE FOR PRE-ORDER NOW**  \n _****_  \n_******* EVERYBODY LOVES SOPHIE KINSELLA: ******* _  \n  \n'A gem of a novel' **JODI PICOULT**  \n  \n'Funny, fast and farcical. I loved it' **JOJO MOYES**  \n  \n'Life doesn't get much better than a new Sophie Kinsella novel' **_RED_ **\n\n"}, {"title": "Killing Commendatore (Kishidancho Goroshi, #1-2)", "author": "Haruki Murakami", "genre": "Romance", "isbn": "9781787300194", "numPages": "704", "description": "The much-anticipated new novel from the internationally acclaimed, best-\nselling author of _1Q84_ and _Colorless Tsukuru Tazaki and His Years of\nPilgrimage_ , _Killing Commendatore_ is an epic tour de force of love and\nloneliness, war and art—as well as a loving homage to _The Great Gatsby_ —and\na stunning work of imagination from one of our greatest writers.\n\n"}, {"title": "The Complete Short Stories: Vol. 4", "author": "Premchand (M. Asaduddin Ed.)", "genre": "Comics & Graphic Novels", "isbn": "9780143442653", "numPages": null, "description": null}, {"title": "The Complete Short Stories: Vol. 3 [Paperback] Premchand", "author": "Premchand (Translated by M. Asaduddin)", "genre": "Comics & Graphic Novels", "isbn": "9780143441304", "numPages": null, "description": null}, {"title": "The Complete Short Stories: Vol. 2", "author": "Premchand (Translated by M. Asaduddin)", "genre": "Comics & Graphic Novels", "isbn": "9780143441298", "numPages": null, "description": null}, {"title": "Quichotte", "author": "Salman Rushdie", "genre": "Children's Books", "isbn": "9780670092796", "numPages": null, "description": "Booker Prize–winning, internationally bestselling author Salman Rushdie\ndelivers an utterly modern remake of Don Quixote with an epic love story set\nin the Age of Anything Can Happen.\n\n"}, {"title": "Long Walk to Freedom", "author": "Nelson Mandela", "genre": "Children's Books", "isbn": "9780349106533", "numPages": "751", "description": "Nelson Mandela is one of the great moral and political leaders of our time: an\ninternational hero whose lifelong dedication to the fight against racial\noppression in South Africa won him the Nobel Peace Prize and the presidency of\nhis country. Since his triumphant release in 1990 from more than a quarter-\ncentury of imprisonment, Mandela has been at the center of the most compelling\nand inspiring political drama in the world. As president of the African\nNational Congress and head of South Africa's antiapartheid movement, he was\ninstrumental in moving the nation toward multiracial government and majority\nrule. He is revered everywhere as a vital force in the fight for human rights\nand racial equality. LONG WALK TO FREEDOM is his moving and exhilarating\nautobiography, destined to take its place among the finest memoirs of\nhistory's greatest figures. Here for the first time, Nelson Rolihlahla Mandela\ntells the extraordinary story of his life--an epic of struggle, setback,\nrenewed hope, and ultimate triumph.\n\n"}, {"title": "A Legacy of Spies", "author": "John le Carré", "genre": "Biographies & Memoirs", "isbn": "9780241308554", "numPages": null, "description": "Peter Guillam, staunch colleague and disciple of George Smiley of the British\nSecret Service, otherwise known as the Circus, has retired to his family\nfarmstead on the south coast of Brittany when a letter from his old Service\nsummons him to London. The reason? His Cold War past has come back to claim\nhim. Intelligence operations that were once the toast of secret London are to\nbe scrutinised by a generation with no memory of the Cold War. Somebody must\nbe made to pay for innocent blood once spilt in the name of the greater good.  \n  \nInterweaving past with present so that each may tell its own story, John le\nCarré has given us a novel of superb and enduring quality.\n\n"}, {"title": "The No. 1 Ladies' Detective Agency (No. 1 Ladies' Detective Agency, #1)", "author": "Alexander McCall Smith", "genre": "Mystery, Thriller & Suspense", "isbn": "9780349116754", "numPages": "233", "description": "THE NO. 1 LADIES’ DETECTIVE AGENCY - Book 1  \n  \nFans around the world adore the bestselling No. 1 Ladies’ Detective Agency\nseries, the basis of the HBO TV show, and its proprietor Precious Ramotswe,\nBotswana’s premier lady detective. In this charming series, Mma Ramotswe\nnavigates her cases and her personal life with wisdom, and good humor—not to\nmention help from her loyal assistant, Grace Makutsi, and the occasional cup\nof tea.  \n  \nMeet Mma Ramotswe, the endearing, engaging, simply irresistible proprietress\nof The No. 1 Ladies Detective Agency, the first and only detective agency in\nBotswana. With persistent observation, gentle intuition, and a keen desire to\nhelp people with the problems of their lives, she solves mysteries great and\nsmall for friends and strangers alike.\n\n"}, {"title": "Fire and Blood: A History of the Targaryen Kings from Aegon the Conqueror to Aegon III", "author": "George R.R. Martin", "genre": "History", "isbn": "9780008312732", "numPages": "709", "description": "With all the fire and fury fans have come to expect from internationally\nbestselling author George R. R. Martin, this is the first volume of the\ndefinitive two-part history of the Targaryens in Westeros.  \n  \nCenturies before the events of _A Game of Thrones_ , House Targaryen—the only\nfamily of dragonlords to survive the Doom of Valyria—took up residence on\nDragonstone. _Fire and Blood begins_ their tale with the legendary Aegon the\nConqueror, creator of the Iron Throne, and goes on to recount the generations\nof Targaryens who fought to hold that iconic seat, all the way up to the civil\nwar that nearly tore their dynasty apart.  \n  \nWhat really happened during the Dance of the Dragons? Why did it become so\ndeadly to visit Valyria after the Doom? What is the origin of Daenerys’s three\ndragon eggs? These are but a few of the questions answered in this essential\nchronicle, as related by a learned maester of the Citadel and featuring more\nthan eighty all-new black-and-white illustrations by artist Doug Wheatley.\nReaders have glimpsed small parts of this narrative in such volumes as _The\nWorld of Ice & Fire_, but now, for the first time, the full tapestry of\nTargaryen history is revealed.  \n  \nWith all the scope and grandeur of Gibbon’s _The History of the Decline and\nFall of the Roman Empire, Fire and Blood_ is the ultimate game of thrones,\ngiving readers a whole new appreciation for the dynamic, often bloody, and\nalways fascinating history of Westeros.\n\n"}, {"title": "As You Like It", "author": "William Shakespeare", "genre": "Children's Books", "isbn": "9780143421856", "numPages": null, "description": "All the world’s a stage, And all the men and women merely players;’ When\nRosalind is banished by her uncle Duke Frederick, who has usurped her father’s\nthrone, she flees to the forest of Arden where her exiled father holds court.\nThere, dressed as a boy to avoid discovery, she encounters the man she loves -\nOrlando, similarly forced into exile by his older brother Oliver - and\nresolves to remain in disguise to test his feelings for her. A gloriously\nsunny comedy, As You Like It is an exuberant combination of concealed\nidentities and verbal jousting, reconciliations and multiple weddings.\n\n"}, {"title": "CHAKRAVYUH - Through the Eyes of the Young Warrior", "author": "Aniket S. Sharma", "genre": "Teen & Young Adult", "isbn": "9781684666232", "numPages": "218", "description": "CHAKRAVYUH is a modern adaptation of the greatest epic ever written in the\nhistory of humankind; MAHABHARATA. This is a retelling of a part of the epic\nfrom the perspective of a young warrior who was descendant of Kuru dynasty;\nborn to lead; but destiny had some other plans for him. A loyal son, a loving\nbrother, a caring husband, a disciplined disciple and a true warrior defied\nall the odds to be decorated in history for many generations to come. His\nskills and intellect were no less than his forefathers, but he was not bound\nto the dogmas  \nfollowed by his ancestors. His judgement of situations was his own, and he\ndidn’t follow the dynastic parlances. In many ways, he was ahead of his times\nand definitely more mature than his age.  \n  \nWhen greed was at its epitome; materialistic desires lead to destruction of\nhumility; the rules of Dharma were rewritten to benefit the selfish desires of\njust a group; A young boy defied all the odds and wrote a new chapter of his\nlife, becoming immortal in our hearts. This is a story of a chosen warrior who\nwas separated from his father at the age of three. This is a story of a boy,\nas handsome as sons of Ashwin brothers; as strong as the son of Vayu; as calm\nas son of Yama; and as skilled as the son of Indra. This is a story of the son\nof Subhadra and nephew of Krishna.  \n  \nThis is the story of ABHIMANYU.\n\n"}, {"title": "The Big Sleep (Philip Marlowe, #1)", "author": "Raymond Chandler", "genre": "Health, Fitness & Dieting", "isbn": "9780241956281", "numPages": "251", "description": "Los Angeles PI Philip Marlowe is working for the Sternwood family. Old man\nSternwood, crippled and wheelchair-bound, is being given the squeeze by a\nblackmailer and he wants Marlowe to make the problem go away. But with\nSternwood's two wild, devil-may-care daughters prowling LA's seedy\nbackstreets, Marlowe's got his work cut out - and that's before he stumbles\nover the first corpse . . .  \n  \nBest-known as the creator of the original private eye, Philip Marlowe, Raymond\nChandler was born in Chicago in 1888 and died in 1959. Many of his books have\nbeen adapted for the screen, and he is widely regarded as one of the very\ngreatest writers of detective fiction. His books include _The Big Sleep_ ,\n_The Little Sister_ , _Farewell, My Lovely_ , _The Long Good-bye_ , _The Lady\nin the Lake_ , _Playback_ , _Killer in the Rain_ , _The High Window_ and\n_Trouble is My Business_.\n\n"}, {"title": "Pride & Prejudice", "author": "Jane Austen", "genre": "Romance", "isbn": "9789387779679", "numPages": null, "description": "books\n\n"}, {"title": "HOMER: The Iliad & The Odyssey", "author": "Homer", "genre": "Literature & Fiction", "isbn": "9789388144292", "numPages": null, "description": "Please Read Notes: Brand New, International Softcover Edition, Printed in\nblack and white pages, minor self wear on the cover or pages, Sale restriction\nmay be printed on the book, but Book name, contents, and author are exactly\nsame as Hardcover Edition. Fast delivery through DHL/FedEx express.\n\n"}, {"title": "Ulysses", "author": "James Joyce", "genre": "Literature & Fiction", "isbn": "9788175994546", "numPages": null, "description": "El Ulises de james Joyce, desde su publicación en 1922 por la librería\nShakespeare and Company de París, tuvo una azarosa vida, en la que su rasgo\nmás característico fue su prohibición a entrar legalmente en los países de\nhabla inglesa y, lógicamente, a ser editado en Inglaterra y Estados Unidos,\nbajo la acusación de atentar contra la moral pública. Sin embargo, mereció\ntambién el calificativo de obra maestra de la literatura contemporánea,\notorgado por los más importantes críticos y escritores de todo el mundo\n\n"}, {"title": "The Murder of Princess Diana", "author": "Noel Botham", "genre": "Biographies & Memoirs", "isbn": "9780786007004", "numPages": "288", "description": "The death of Princess Diana, Princess of Wales, sent shockwaves around the\nworld. A nation was left in mourning, but soon feelings of suspicion surfaced:\nwas her death all that the Establishment might wish us to believe? Now, after\nan exhaustive two-year probe, investigative writer and former journalist Noel\nBotham has dared to reveal what the people of Britain have always believed -\nthat Diana's death was murder.\n\nUsing his unique contacts in the secretive worlds of intelligence and royalty,\nthe author has uncovered the facts that prove Diana was - as she herself\npredicted she would be - the victim of a professional hit squad. He presents a\nclear account of what really happened on that fateful day of 31 August 1997.\nWhy was the killing sanctioned? How was it executed? Was there really another\ncar in the tunnel at the time of the crash? All of these questions and more,\nincluding how the truth was covered up by an official whitewash, are answered.\n\nThis astounding book is what all enquiring minds have been waiting for,\nblowing the lid off the secrets the Establishment does not want us to know.\n\"The Murder of Princess Diana\" firmly lays to rest the theory that Diana's\ndeath was a tragic accident, and finally gives the people of Britain the\nexplanation they deserve.\n\n"}, {"title": "The Running Man", "author": "Richard Bachman", "genre": "Sports & Outdoors", "isbn": "9780451197962", "numPages": "317", "description": "_The Running Man_ is set within a dystopian future in which the poor are seen\nmore by the government as worrisome rodents than actual human beings. The\nprotagonist of The Running Man, Ben Richards, is quick to realize this as he\nwatches his daughter, Cathy, grow more sick by the day and tread closer and\ncloser to death. Desperate for money to pay Cathy’s medical bills, Ben enlists\nhimself in a true reality style game show where the objective is to merely\nstay alive.\n\n"}, {"title": "Best of Friends", "author": "Cathy Kelly", "genre": "Children's Books", "isbn": "9780743490252", "numPages": "528", "description": "**_You can have it all!_ **  \n  \nAbby Barton's TV career is taking off and now she and her husband can have the\nlife they've always dreamed of in a lovely Irish town -- at least, in theory!\nBut when your husband takes you for granted and your teenage daughter hates\nyou, an adoring old flame can spell danger to your seemingly perfect life.\nFortunately, Abby has her friends to keep her sane. For starters, her best\nfriend, Sally, owns a beauty salon, and Sally and her husband throw fantastic\nparties, where there are still more friends to be made.  \n  \n**_Just be sure to share._ **  \n  \nSally's friend Lizzie makes time for everybody: her gal pals, her grown\nchildren, even her ex-husband. But when her ex finds someone new, Lizzie can't\nhelp but wonder if she'll ever love again. The women are all thrilled to meet\nErin, who has moved home to Ireland from Chicago for her husband's new job.\nBut is she cut out for small-town life, and what of the family she left behind\nyears ago? Together and on their own, these four women are about to face highs\nand lows they never anticipated. Only from each other can they learn that life\nis for the living and that they need to grab it with both hands....\n\n"}, {"title": "Fatal Cure", "author": "Robin Cook", "genre": "Health, Fitness & Dieting", "isbn": "9780399138799", "numPages": "447", "description": "From the master of medical thrillers, a heart-stopping tale set at that\nuncertain juncture where the best medical care in the world intersects with\nfinancial pragmatism. From antiseptic corridors to posh boardrooms where\nmatters of life and death are weighed as casually as dollars and cents, Fatal\nCure explores the dark potential of those sworn to do no harm.\n\n"}, {"title": "The Broker", "author": "John Grisham", "genre": "Business & Money", "isbn": "9780440241584", "numPages": "422", "description": "Grisham's latest #1 New York Times bestseller about a Washington power broker,\nwho is pardoned by the President of his crimes and used by the CIA as bait for\ninternational assassins, is now in paperback.\n\n"}, {"title": "The King of Torts", "author": "John Grisham", "genre": "Law", "isbn": "9780440241539", "numPages": "472", "description": "The office of the public defender is not known as a training ground for bright\nyoung litigators. Clay Carter has been there too long and, like most of his\ncolleagues, dreams of a better job in a real firm. When he reluctantly takes\nthe case of a young man charged with a random street killing, he assumes it is\njust another of the many senseless murders that hit D.C. every week.  \nAs he digs into the background of his client, Clay stumbles on a conspiracy\ntoo horrible to believe. He suddenly finds himself in the middle of a complex\ncase against one of the largest pharmaceutical companies in the world, looking\nat the kind of enormous settlement that would totally change his life--that\nwould make him, almost overnight, the legal profession's newest king of\ntorts... \"From the Hardcover edition.\"\n\n"}, {"title": "The Pelican Brief", "author": "John Grisham", "genre": "Literature & Fiction", "isbn": "9780440214045", "numPages": "436", "description": "IN SUBURBAN GEORGETOWN A KILLER'S REEBOKS WHISPER ON THE FLOOR OF A POSH HOME\n...  \n  \nIN A SEEDY D.C. PORNO HOUSE A PATRON IS SWIFTLY GARROTED TO DEATH ...  \n  \nThe next day America learns that two of its Supreme Court justices have been\nassassinated. And in New Orleans, a young law student prepares a legal brief\n...  \n  \nTo Darby Shaw it was no more than a legal shot in the dark, a brilliant guess.\nTo the Washington establishment it was political dynamite. Suddenly Darby is\nwitness to a murder—a murder intended for her. Going underground, she finds\nthere is only one person she can trust—an ambitious reporter after a newsbreak\nhotter than Watergate—to help her piece together the deadly puzzle. Somewhere\nbetween the bayous of Louisiana and the White House's inner sanctums, a\nviolent cover-up is being engineered. For someone has read Darby's brief.\nSomeone who will stop at nothing to destroy the evidence of an unthinkable\ncrime.  \n  \n\\--back cover\n\n"}, {"title": "A Painted House", "author": "John Grisham", "genre": "Crafts, Hobbies & Home", "isbn": "9780099416159", "numPages": "466", "description": "_The hill people and the Mexicans arrived on the same day. It was a Wednesday,\nearly in September 1952. The Cardinals were five games behind the Dodgers with\ntwo weeks to go, and the season looked hopeless. The cotton, however, was\nwaist high to my father, almost over my head, and he and my grandfather could\nbe heard before supper whispering words that were seldom heard. It could be a\n\"good crop.\"_  \n  \nThus begins the new novel from John Grisham, a story inspired by his own\nchildhood in rural Arkansas. The narrator is a seven year old farm boy named\nLuke Chandler, who lives in the cotton fields with his parents and\ngrandparents in a little house that's never been painted. The Chandlers farm\neighty acres that they rent, not own, and when the cotton is ready they hire a\ntruckload of Mexicans and a family from the Ozarks to help harvest it.  \n  \nFor six weeks they pick cotton, battling the heat, the rain, the fatigue, and\nsometimes, each other. As the weeks pass Luke sees and hears things no seven\nyear old could possibly be prepared for, and finds himself keeping secrets\nthat not only threaten the crop but will change the lives of the Chandlers\nforever. _A Painted House_ is a moving story of one boy's journey from\ninnocence to experience.\n\n"}, {"title": "The Chamber", "author": "John Grisham", "genre": "Literature & Fiction", "isbn": null, "numPages": "676", "description": "In the corridors of Chicago's top law firm: Twenty-six-year-old Adam Hall\nstands on the brink of a brilliant legal career. Now he is risking it all for\na death-row killer and an impossible case.  \n  \nMaximum Security Unit, Mississippi State Prison:  \n  \nSam Cayhall is a former Klansman and unrepentant racist now facing the death\npenalty for a fatal bombing in 1967. He has run out of chances -- except for\none: the young, liberal Chicago lawyer who just happens to be his grandson.\nWhile the executioners prepare the gas chamber, while the protesters gather\nand the TV cameras wait, Adam has only days, hours, minutes to save his\nclient. For between the two men is a chasm of shame, family lies, and secrets\n-- including the one secret that could save Sam Cayhall's life...or cost Adam\nhis.  \n  \n\"A dark and thoughtful tale pulsing wit moral uncertainties... Grisham is at\nhis best.\" -- \"People.\"  \n  \n\"Compelling... Powerful... \"The Chamber\" will make readers think long and hard\nabout the death penalty.\" -- \"USA Today.\"  \n  \n\"His best yet.\" -- \"The Houston Post.\"  \n  \n\"Mesmerizing... with an authority and originality... and with a grasp of\nliterary complexity that makes Scott Turow's novels pale by comparison --\nGrisham returns.\" -- \"San Francisco Chronicle.\"\n\n"}, {"title": "The Partner", "author": "John Grisham", "genre": "Self-Help", "isbn": "9780440224761", "numPages": "480", "description": "They watched Danilo Silva for days before they finally grabbed him. He was\nliving alone, a quiet life on a shady street in a small town in Brazil; a\nsimple life in a modest home, certainly not one of luxury. Certainly no\nevidence of the fortune they thought he had stolen. He was much thinner and\nhis face had been altered. He spoke a different language, and spoke it very\nwell. But Danilo had a past with many chapters. Four years earlier he had been\nPatrick Lanigan, a young partner in a prominent Biloxi law firm. He had a\npretty wife, a new daughter, and a bright future. Then one cold winter night\nPatrick was trapped in a burning car and died a horrible death. When he was\nburied his casket held nothing more than his ashes. From a short distance\naway, Patrick watched his own burial. Then he fled. Six weeks later, a fortune\nwas stolen from his ex-law firm's offshore account. And Patrick fled some\nmore. But they found him.\n\n"}, {"title": "Beloved", "author": "Toni Morrison", "genre": "Religion & Spirituality", "isbn": "9780099273936", "numPages": "324", "description": "It is the mid-1800s. At Sweet Home in Kentuckhy, an era is ending as slavery\ncomes under attack from the abolitionists. The worlds of Halle and Paul D. are\nto be destroyed in a cataclysm of torment and agony. The world of Sethe,\nhowever, is to turn from one of love to one of violence and death - the death\nof Sethe's baby daughter Beloved, whose name is the single word on the\ntombstone, who died at her mother's hands, and who will return to claim\nretribution.  \n  \n ****One of the BBC’s 100 Novels That Shaped Our World****\n\n"}, {"title": "The Trial", "author": "Franz Kafka", "genre": "Law", "isbn": "9780099428640", "numPages": "255", "description": "Written in 1914 but not published until 1925, a year after Kafka’s death, _The\nTrial_ is the terrifying tale of Josef K., a respectable bank officer who is\nsuddenly and inexplicably arrested and must defend himself against a charge\nabout which he can get no information. Whether read as an existential tale, a\nparable, or a prophecy of the excesses of modern bureaucracy wedded to the\nmadness of totalitarianism, _The Trial_ has resonated with chilling truth for\ngenerations of readers.\n\n"}, {"title": "Brave New World", "author": "Aldous Huxley", "genre": "Children's Books", "isbn": "9780099477464", "numPages": "229", "description": "_Librarian's note: There is an Alternate Cover Edition for this edition of\nthis book[here](https://www.goodreads.com/book/show/16060178.here \"here\")._  \n  \nWith introductions by Margaret Atwood and David Bradshaw.  \n  \nFar in the future, the World Controllers have created the ideal society.\nThrough clever use of genetic engineering, brainwashing and recreational sex\nand drugs all its members are happy consumers. Bernard Marx seems alone\nharbouring an ill-defined longing to break free. A visit to one of the few\nremaining Savage Reservations where the old, imperfect life still continues,\nmay be the cure for his distress...  \n  \nHuxley's ingenious fantasy of the future sheds a blazing light on the present\nand is considered to be his most enduring masterpiece.\n\n"}]